app/views/wallets/show.html.haml

%h1=@wallet.name + "'s wallet"
-	@wallet.credit_cards.each do |credit_card|
---
SELECT "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."wallet_id" = ?  [["wallet_id", 1]]