app/controllers/wallets_controller.rb

  def index
    @wallets = Wallet.all
---
SELECT "wallets".* FROM "wallets"

  def create
    @wallet = Wallet.new(wallet_params)

    respond_to do |format|
      if @wallet.save
---
INSERT INTO "wallets" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "elad"], ["created_at", "2018-01-11 02:06:36.007226"], ["updated_at", "2018-01-11 02:06:36.007226"]]

    def set_wallet
      @wallet = Wallet.find(params[:id])
---
SELECT  "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT 1  [["id", 1]]